# 1. **Data Understanding**

![teks alternatif](https://spotonwifi.com/wp-content/uploads/2019/09/3-tips-segmentation-og.webp)

Pada penelitian kali ini saya menggunakan dataset transaction_data dari kaggle.com

In [12]:
import pandas as pd
rwData = pd.read_csv('Dataset/transaction_data.csv')

In [13]:
rwData.head(5)

,UserId,TransactionId,TransactionTime,ItemCode,ItemDescription,NumberOfItemsPurchased,CostPerItem,Country
0,278166,6355745,Sat Feb 02 12:50:00 IST 2019,465549,FAMILY ALBUM WHITE PICTURE FRAME,6,11.73,United Kingdom
1,337701,6283376,Wed Dec 26 09:06:00 IST 2018,482370,LONDON BUS COFFEE MUG,3,3.52,United Kingdom
2,267099,6385599,Fri Feb 15 09:45:00 IST 2019,490728,SET 12 COLOUR PENCILS DOLLY GIRL,72,0.90,France
3,380478,6044973,Fri Jun 22 07:14:00 IST 2018,459186,UNION JACK FLAG LUGGAGE TAG,3,1.73,United Kingdom
4,-1,6143225,Mon Sep 10 11:58:00 IST 2018,1733592,WASHROOM METAL SIGN,3,3.40,United Kingdom

In [14]:
rwData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1083818 entries, 0 to 1083817
Data columns (total 8 columns):
 #   Column                  Non-Null Count    Dtype
---  ------                  --------------    -----
 0   UserId                  1083818 non-null  int64
 1   TransactionId           1083818 non-null  int64
 2   TransactionTime         1083818 non-null  object
 3   ItemCode                1083818 non-null  int64
 4   ItemDescription         1080910 non-null  object
 5   NumberOfItemsPurchased  1083818 non-null  int64
 6   CostPerItem             1083818 non-null  float64
 7   Country                 1083818 non-null  object
dtypes: float64(1), int64(4), object(3)
memory usage: 66.2+ MB

In [15]:
print(rwData.isnull().sum())

UserId                       0
TransactionId                0
TransactionTime              0
ItemCode                     0
ItemDescription           2908
NumberOfItemsPurchased       0
CostPerItem                  0
Country                      0
dtype: int64

In [16]:
trans_df = rwData.dropna(subset=['ItemDescription'])

In [17]:
print(trans_df.isnull().sum())

UserId                    0
TransactionId             0
TransactionTime           0
ItemCode                  0
ItemDescription           0
NumberOfItemsPurchased    0
CostPerItem               0
Country                   0
dtype: int64

In [18]:
trans_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1080910 entries, 0 to 1083817
Data columns (total 8 columns):
 #   Column                  Non-Null Count    Dtype
---  ------                  --------------    -----
 0   UserId                  1080910 non-null  int64
 1   TransactionId           1080910 non-null  int64
 2   TransactionTime         1080910 non-null  object
 3   ItemCode                1080910 non-null  int64
 4   ItemDescription         1080910 non-null  object
 5   NumberOfItemsPurchased  1080910 non-null  int64
 6   CostPerItem             1080910 non-null  float64
 7   Country                 1080910 non-null  object
dtypes: float64(1), int64(4), object(3)
memory usage: 74.2+ MB

In [19]:
df_filtered = trans_df[trans_df['NumberOfItemsPurchased'] > 0]
df_filtered = df_filtered[df_filtered['UserId'] > 0]
df_filtered = df_filtered[df_filtered['ItemCode'] > 0]
df_filtered = df_filtered[df_filtered['CostPerItem'] > 0]

In [20]:
df_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 792940 entries, 0 to 1083817
Data columns (total 8 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   UserId                  792940 non-null  int64
 1   TransactionId           792940 non-null  int64
 2   TransactionTime         792940 non-null  object
 3   ItemCode                792940 non-null  int64
 4   ItemDescription         792940 non-null  object
 5   NumberOfItemsPurchased  792940 non-null  int64
 6   CostPerItem             792940 non-null  float64
 7   Country                 792940 non-null  object
dtypes: float64(1), int64(4), object(3)
memory usage: 54.4+ MB

In [22]:
df_filtered.describe()

,UserId,TransactionId,ItemCode,NumberOfItemsPurchased,CostPerItem
count,792940.000000,7.929400e+05,7.929400e+05,792940.000000,7.929400e+05
mean,321330.406328,6.166808e+06,6.458165e+05,39.025561,8.263905e+00
std,35905.210683,1.441680e+05,4.328288e+05,538.833396,2.693975e+03
min,259266.000000,5.900015e+06,4.200000e+01,3.000000,6.000000e-02
25%,293475.000000,6.041585e+06,4.625670e+05,6.000000,1.730000e+00
50%,318339.000000,6.180823e+06,4.759860e+05,18.000000,2.700000e+00
75%,352821.000000,6.293001e+06,4.886700e+05,36.000000,5.180000e+00
max,384027.000000,6.397457e+06,1.894494e+06,242985.000000,1.696285e+06